In [1]:
import boto3
import pandas as pd
from io import StringIO
import re
import time

In [3]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM countrycode'
}
session = boto3.Session()

In [95]:
athena_client = boto3.client("athena",
                            aws_access_key_id = AWS_ACCESS_KEY,
                            aws_secret_access_key= AWS_SECRET_KEY,
                            region_name = AWS_REGION,
            )

In [2]:
def athena_query(client, params):
    """The following function will dispatch the query to Athena
    with our details and return an execution object"""
    response = client.start_query_execution(
        QueryString=params["query"],
        QueryExecutionContext={
            'Database': params['database']
        },
        ResultConfiguration={
            'OutputLocation': 's3://' + params['bucket'] + '/' + params['path']
        }
    )
    return response
  
def athena_to_s3(session, params, max_execution = 5):
    """This function will:
    1. Dispatch the query to Athena
    2. Poll the results and once the query is finished
    3. Return the filename in S3 where the query results are stored"""
    client = session.client('athena',
                            aws_access_key_id = params['access_key'],
                            aws_secret_access_key = params['secret_key'],
                            region_name=params["region"])
    execution = athena_query(client, params)
    execution_id = execution['QueryExecutionId']
    state = 'RUNNING'

    while (max_execution > 0 and state in ['RUNNING', 'QUEUED']):
        max_execution = max_execution - 1
        response = client.get_query_execution(QueryExecutionId = execution_id)

        if 'QueryExecution' in response and \
                'Status' in response['QueryExecution'] and \
                'State' in response['QueryExecution']['Status']:
            state = response['QueryExecution']['Status']['State']
            if state == 'FAILED':
                return False
            elif state == 'SUCCEEDED':
                s3_path = response['QueryExecution']['ResultConfiguration']['OutputLocation']
                filename = re.findall('.*\/(.*)', s3_path)[0]  

                # Download csv file
                temp_file_location: str = "athena_query_result.csv"
                s3_client = boto3.client(
                  "s3",
                  aws_access_key_id = params['access_key'],
                  aws_secret_access_key = params['secret_key'],
                  region_name=params["region"]
                )
                s3_client.download_file(params['bucket'],
                                        f"{params['path']}/{filename}",
                                        temp_file_location
                )
                return pd.read_csv(temp_file_location)

        time.sleep(1)
   
    return False

In [127]:
countrycode = athena_to_s3(session, params)
countrycode.head()

          country alpha-2 code alpha-3 code  numeric code  latitude  longitude
0     Afghanistan           AF          AFG           4.0   33.0000       65.0
1         Albania           AL          ALB           8.0   41.0000       20.0
2         Algeria           DZ          DZA          12.0   28.0000        3.0
3  American Samoa           AS          ASM          16.0  -14.3333     -170.0
4         Andorra           AD          AND          20.0   42.5000        1.6

In [128]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM countypopulation'
}

countypopulation = athena_to_s3(session, params)
countypopulation.head()

               id   id2   county    state  population estimate 2018
0  0500000US01001  1001  Autauga  Alabama                     55601
1  0500000US01003  1003  Baldwin  Alabama                    218022
2  0500000US01005  1005  Barbour  Alabama                     24881
3  0500000US01007  1007     Bibb  Alabama                     22400
4  0500000US01009  1009   Blount  Alabama                     57840

In [9]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM states_daily'
}

states_daily = athena_to_s3(session, params)
states_daily.head()

,date,state,positive,probablecases,negative,pending,totaltestresultssource,totaltestresults,hospitalizedcurrently,hospitalizedcumulative,...,dataqualitygrade,deathincrease,hospitalizedincrease,hash,commercialscore,negativeregularscore,negativescore,positivescore,score,grade
0,20210307,AK,56886,NaN,NaN,NaN,totalTestsViral,1731628,33.0,1293.0,...,NaN,0.0,0.0,dc4bccd4bb885349d7e94d6fed058e285d4be164,0.0,0.0,0.0,0.0,0.0,NaN
1,20210307,AL,499819,107742.0,1931711.0,NaN,totalTestsPeopleViral,2323788,494.0,45976.0,...,NaN,-1.0,0.0,997207b430824ea40b8eb8506c19a93e07bc972e,0.0,0.0,0.0,0.0,0.0,NaN
2,20210307,AR,324818,69092.0,2480716.0,NaN,totalTestsViral,2736442,335.0,14926.0,...,NaN,22.0,11.0,50921aeefba3e30d31623aa495b47fb2ecc72fae,0.0,0.0,0.0,0.0,0.0,NaN
3,20210307,AS,0,NaN,2140.0,NaN,totalTestsViral,2140,NaN,NaN,...,NaN,0.0,0.0,96d23f888c995b9a7f3b4b864de6414f45c728ff,0.0,0.0,0.0,0.0,0.0,NaN
4,20210307,AZ,826454,56519.0,3073010.0,NaN,totalTestsViral,7908105,963.0,57907.0,...,NaN,5.0,44.0,0437a7a96f4471666f775e63e86923eb5cbd8cdf,0.0,0.0,0.0,0.0,0.0,NaN

In [132]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM us_daily'
}

us_daily = athena_to_s3(session, params)
us_daily.head()

,date,states,positive,negative,pending,hospitalizedcurrently,hospitalizedcumulative,inicucurrently,inicucumulative,onventilatorcurrently,...,lastmodified,recovered,total,posneg,deathincrease,hospitalizedincrease,negativeincrease,positiveincrease,totaltestresultsincrease,hash
0,20210307,56,28755524.0,74579770.0,11808.0,40212.0,878613.0,8137.0,45475.0,2801.0,...,2021-03-07T24:00:00Z,NaN,0,0,839,726,130414,41265,1156241,8b26839690cd05c0cef69cb9ed85641a76b5e78e
1,20210306,56,28714259.0,74449356.0,11783.0,41401.0,877887.0,8409.0,45453.0,2811.0,...,2021-03-06T24:00:00Z,NaN,0,0,1674,503,142201,59620,1409138,d0c0482ea549c9d5c04a7c86acb6fc6a8095a592
2,20210305,56,28654639.0,74307155.0,12213.0,42541.0,877384.0,8634.0,45373.0,2889.0,...,2021-03-05T24:00:00Z,NaN,0,0,2221,2781,271917,68787,1744417,a35ea4289cec4bb55c9f29ae04ec0fd5ac4e0222
3,20210304,56,28585852.0,74035238.0,12405.0,44172.0,874603.0,8970.0,45293.0,2973.0,...,2021-03-04T24:00:00Z,NaN,0,0,1743,1530,177957,65487,1590984,a19ad6379a653834cbda3093791ad2c3b9fab5ff
4,20210303,56,28520365.0,73857281.0,11778.0,45462.0,873073.0,9359.0,45214.0,3094.0,...,2021-03-03T24:00:00Z,NaN,0,0,2449,2172,267001,66836,1406795,9e1d2afda1b0ec243060d6f68a7134d011c0cb2a

In [133]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM rearc_usa_hospital_bedsus_total_latest'
}

rearc_usa_hospital = athena_to_s3(session, params)
rearc_usa_hospital.head()

,positive,negative,pending,hospitalizedcurrently,hospitalizedcumulative,inicucurrently,inicucumulative,onventilatorcurrently,onventilatorcumulative,recovered,hash,lastmodified,death,hospitalized,total,totaltestresults,posneg,notes
0,1061101,5170081,2775,53793,111955,9486,4192,4712,373,153947,95064ba29ccbc20dbec397033dfe4b1f45137c99,2020-05-01T09:12:31.891Z,57266,111955,6233957,6231182,6231182,"""NOTE: """"total"""""

In [17]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM us_countryus_county'
}

us_countryus_county = athena_to_s3(session, params)
us_countryus_county.head()

         date     county       state     fips  cases  deaths
0  2020-01-21  Snohomish  Washington  53061.0    1.0     0.0
1  2020-01-22  Snohomish  Washington  53061.0    1.0     0.0
2  2020-01-23  Snohomish  Washington  53061.0    1.0     0.0
3  2020-01-24       Cook    Illinois  17031.0    1.0     0.0
4  2020-01-24  Snohomish  Washington  53061.0    1.0     0.0

In [19]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM us_states'
}

us_states = athena_to_s3(session, params)
us_states.head()

         date       state  fips  cases  deaths
0  2020-01-21  Washington    53      1       0
1  2020-01-22  Washington    53      1       0
2  2020-01-23  Washington    53      1       0
3  2020-01-24    Illinois    17      1       0
4  2020-01-24  Washington    53      1       0

In [4]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM rearc_usa_hospital_bedsstate_abv'
}

rearc_usa_hospital_bedsstate_abv = athena_to_s3(session, params)
rearc_usa_hospital_bedsstate_abv.head()

       col0          col1
0     State  Abbreviation
1   Alabama            AL
2    Alaska            AK
3   Arizona            AZ
4  Arkansas            AR

In [13]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM rearc_usa_hospital_bedsusa_hospital_beds_geojson_4cca297c'
}

rearc_usa_hospital_bedsusa_hospital_beds_geojson_4cca297c = athena_to_s3(session, params)

In [16]:
params = {
    'access_key': 'AKIAXBCNHRUZOMCU4F4D', 
    'secret_key': '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',
    'region': 'ap-south-1',
    'database': 'first-data-book',
    'bucket': 'data-engineer-project-dataset',
    'path': 'books',
    'query': 'SELECT * FROM enigma_jhud'
}

enigma_jhud = athena_to_s3(session, params)

# " Transform " data from Pandas dataframe...

In [6]:
#in above dataframe we should have to take 0th record as header
new_header = rearc_usa_hospital_bedsstate_abv.iloc[0] # grab first row for the header
rearc_usa_hospital_bedsstate_abv = rearc_usa_hospital_bedsstate_abv[1:] # take the data from 2nd row
rearc_usa_hospital_bedsstate_abv.columns=new_header # header row as df header

In [7]:
rearc_usa_hospital_bedsstate_abv.head() # FIXED !!!

0       State Abbreviation
1     Alabama           AL
2      Alaska           AK
3     Arizona           AZ
4    Arkansas           AR
5  California           CA

# Transforming data for create start schema

In [10]:
states_daily
dimDate = states_daily[['fips','date']]
dimDate.head()

   fips      date
0   2.0  20210307
1   1.0  20210307
2   5.0  20210307
3  60.0  20210307
4   4.0  20210307

In [11]:
dimDate['date'] = pd.to_datetime(dimDate['date'],format='%Y%m%d') # Transforming Date into readable format
dimDate['year'] =dimDate['date'].dt.year
dimDate['month'] =dimDate['date'].dt.month
dimDate['day_of_week'] =dimDate['date'].dt.dayofweek
dimDate.head()

c:\paythone 3.7\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.
c:\paythone 3.7\lib\site-packages\ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

c:\paythone 3.7\lib\site-packages\ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  This is separate from the ipykernel package so we can avoid doing imports until
c:\paythone 3.7\lib\site-packages\ipykernel_launcher.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  after removing the cwd from sys.path.

   fips       date  year  month  day_of_week
0   2.0 2021-03-07  2021      3            6
1   1.0 2021-03-07  2021      3            6
2   5.0 2021-03-07  2021      3            6
3  60.0 2021-03-07  2021      3            6
4   4.0 2021-03-07  2021      3            6

In [43]:
dimRegion1 = us_countryus_county

In [44]:
dimRegion2 = us_states

# " Store " data into AWS S3 from Pandas dataframe...

In [39]:
session = boto3.Session(
aws_access_key_id='AKIAXBCNHRUZOMCU4F4D',
aws_secret_access_key='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'
)

In [41]:
s3_res = session.resource('s3')

csv_buffer = StringIO()

dimDate.to_csv(csv_buffer)

bucket_name = 'first1-bucket2-project3'

s3_object_name = 'dimDate.csv'

s3_res.Object(bucket_name, s3_object_name).put(Body=csv_buffer.getvalue())

print("Dataframe is saved as CSV in S3 bucket.")

Dataframe is saved as CSV in S3 bucket.

In [46]:
s3_res = session.resource('s3')

csv_buffer = StringIO()

dimRegion2.to_csv(csv_buffer)

bucket_name = 'first1-bucket2-project3'

s3_object_name = 'dimRegion2.csv'

s3_res.Object(bucket_name, s3_object_name).put(Body=csv_buffer.getvalue())

print("Dataframe is saved as CSV in S3 bucket.")

Dataframe is saved as CSV in S3 bucket.

In [45]:
s3_res = session.resource('s3')

csv_buffer = StringIO()

dimRegion1.to_csv(csv_buffer)

bucket_name = 'first1-bucket2-project3'

s3_object_name = 'dimRegion1.csv'

s3_res.Object(bucket_name, s3_object_name).put(Body=csv_buffer.getvalue())

print("Dataframe is saved as CSV in S3 bucket.")

Dataframe is saved as CSV in S3 bucket.

In [47]:
dimDateSQL = pd.io.sql.get_schema(dimDate.reset_index(),'dimDate')
print(''.join(dimDateSQL))

CREATE TABLE "dimDate" (
"index" INTEGER,
  "fips" REAL,
  "date" TIMESTAMP,
  "year" INTEGER,
  "month" INTEGER,
  "day_of_week" INTEGER
)

In [52]:
dimDateSQL = pd.io.sql.get_schema(dimRegion1.reset_index(),'dimRegion1')
print(''.join(dimDateSQL))

CREATE TABLE "dimRegion1" (
"index" INTEGER,
  "date" TEXT,
  "county" TEXT,
  "state" TEXT,
  "fips" REAL,
  "cases" REAL,
  "deaths" REAL
)

In [53]:
dimDateSQL = pd.io.sql.get_schema(dimRegion2.reset_index(),'dimRegion2')
print(''.join(dimDateSQL))

CREATE TABLE "dimRegion2" (
"index" INTEGER,
  "date" TEXT,
  "state" TEXT,
  "fips" INTEGER,
  "cases" INTEGER,
  "deaths" INTEGER
)

# " Load " data from AWS S3 to AWS Redshift...

In [38]:
import redshift_connector

In [47]:
conn = redshift_connector.connect(
    host='redshift-cluster-2.cqkv6evg4als.ap-south-1.redshift.amazonaws.com',
    database='dev',
    user='awsuser',
    password='Satish123'
 )

In [41]:
conn.autocommit = True

In [42]:
cursor = redshift_connector.Cursor = conn.cursor()

In [43]:
cursor.execute(
"""CREATE TABLE "dimDate" (
"index" INTEGER,
  "fips" REAL,
  "date" TIMESTAMP,
  "year" INTEGER,
  "month" INTEGER,
  "day_of_week" INTEGER
)""")

In [44]:
cursor.execute("""CREATE TABLE "dimRegion2" (
"index" INTEGER,
  "date" TEXT,
  "state" TEXT,
  "fips" INTEGER,
  "cases" INTEGER,
  "deaths" INTEGER
)""")

In [45]:
cursor.execute("""CREATE TABLE "dimRegion1" (
"index" INTEGER,
  "date" TEXT,
  "county" TEXT,
  "state" TEXT,
  "fips" REAL,
  "cases" REAL,
  "deaths" REAL
)""")

# Done !!!

# Now, Data is ready For further Analysis and also can visulize data directly from redshift warehouse.

# Thank you